"use client"
import StampComponent from "@/component/shared/dashed/Dashed"
import { useState } from "react"

export default function FileTwelveDesignSeven() {

    const workItems = [
        {

            title: "Τοποθέτηση ικριωμάτων επί των όψεων του κτιρίου",
            description:
                "Περιλαμβάνεται η εγκατάσταση μεταλλικών ικριωμάτων κατά μήκος των όψεων του κτιρίου, σύμφωνα με την ισχύουσα νομοθεσία περί μέτρων ασφαλείας. Η τοποθέτηση διασφαλίζει ασφαλή και πλήρη πρόσβαση στα σημεία επέμβασης για τις εργασίες αποκατάστασης και χρωματισμού των εξωτερικών επιφανειών.",
            // title: "Αλλαγή Χρήσης Χώρου",
            // description: `Αφορά την τροποποίηση της χρήσης του χώρου `,
            // fields: [
            //     { key: "area", placeholder: "εμβαδόν … τ.μ." },
            //     { key: "currentUse", placeholder: "αποθήκης/χώρου στάθμευσης" },
            //     { key: "floor", placeholder: "όροφο/ισόγειο/υπόγειο" },
            //     { key: "access", placeholder: "ιδιωτικής εισόδου ή κοινόχρηστων χώρων" },
            //     { key: "newUse", placeholder: "κατοικία, κατάστημα κλπ." },
            // ],
            // fullText: `(π.χ. ισόγειου αποθηκευτικού χώρου με εμβαδόν … τ.μ.), ο οποίος βάσει της εγκεκριμένης οικοδομικής άδειας ………/……… φέρει χρήση …………………… (π.χ. αποθήκης/χώρου στάθμευσης) και βρίσκεται στον …………………… (όροφο/ισόγειο/υπόγειο), με αυτόνομη πρόσβαση μέσω …………………… (π.χ. ιδιωτικής εισόδου ή κοινόχρηστων χώρων). Η κατασκευή του χώρου είναι σύμφωνη με την εγκεκριμένη στατική και αρχιτεκτονική μελέτη της άδειας. Η προτεινόμενη αλλαγή χρήσης αφορά τη μετατροπή του σε …………………… (π.χ. κατοικία, κατάστημα κλπ.), χωρίς επέμβαση στον φέροντα οργανισμό ή τροποποίηση του εξωτερικού όγκου και των όψεων του κτιρίου, ενώ η νέα χρήση είναι πλήρως συμβατή με τις θεσμοθετημένες χρήσεις γης της περιοχής.`,
        },
        {
            title: "Έλεγχος & Αποκατάσταση Φθαρμένων Υλικών:",
            description:
                "Έλεγχος της στέγης για ανίχνευση φθαρμένων ή αποσαθρωμένων στοιχείων (κεραμίδια, επικάλυψη, υδρορροές, μεταλλικά στηρίγματα κ.λπ.). Αντικατάσταση ή επισκευή των φθαρμένων υλικών."
        },
        {
            title: "  Αποξήλωση παλαιών, φθαρμένων ή σαθρών κεραμιδιών ή άλλου τύπου επικάλυψης στεγών.",
            description:
                "Αφαίρεση υποστρώσεων (π.χ. παλιά ελαφρομπετά, φύλλα ασφαλτικών μεμβρανών κ.λπ.) όπου απαιτείται.Αποξήλωση φθαρμένων υδρορροών και λοιπών στοιχείων απορροής ομβρίων.",
        },
        {
            title: " Επισκευή Φέροντος Ξύλινου Σκελετού ",
            description: "Αντικατάσταση σάπιων ή φθαρμένων τμημάτων του φέροντος ξύλινου σκελετού της στέγης (π.χ. ζευκτών, τεγίδων, δοκαριών), χωρίς αλλαγή στη γεωμετρία και χωρίς τροποποίηση της στατικής δομής.Εφαρμογή αντισηπτικών και προστατευτικών υλικών στα νέα και στα υπάρχοντα ξύλινα στοιχεία.",
        },
        {
            title: " Στεγανοποίηση – Υδατοστεγανότητα",
            description:
                "Εφαρμογή νέων ασφαλτικών μεμβρανών ή άλλων σύγχρονων υλικών στεγανοποίησης.Προσθήκη ή αντικατάσταση υδρορροών, καναλιών απορροής και τελικών στοιχείων απορροής υδάτων.Στεγανοποίηση αρμών και κρίσιμων σημείων διέλευσης (π.χ. καμινάδες, φωταγωγοί).",
        },
        {
            title: " Καθαρισμός Υδρορροών & Συστήματος Απορροής",
            description:
                "Απομάκρυνση φερτών υλικών, φύλλων, και ξένων σωμάτων από υδρορροές, υδροσυλλέκτες και κατακόρυφες στήλες αποχέτευσης ομβρίων.",
        },
        {
            title: "Τοποθέτηση Νέας Επικάλυψης Στέγης",
            description:
                "Τοποθέτηση νέων κεραμιδιών ή άλλης εγκεκριμένης επικάλυψης (π.χ. κεραμίδια βυζαντινού ή ρωμαϊκού τύπου ή άλλο κατάλληλο υλικό).Εξασφάλιση σωστής πρόσδεσης και στερέωσης για αντοχή σε ανεμοπιέσεις.Εφαρμογή αναπνεόμενης μεμβράνης όπου απαιτείται από τη μελέτη.",
        },
        {
            title: " Εφαρμογή προστατευτικών επιστρώσεων (όπου απαιτείται):",
            description:
                "Τοπική ή συνολική εφαρμογή ελαστομερούς υδατοστεγανωτικής βαφής, αν απαιτείται από τη φύση των επεμβάσεων.",
        },
        // {
        //     description:
        //         "Για το σύνολο των προβλεπόμενων εργασιών δεν απαιτείται η υποβολή αρχιτεκτονικών όψεων, καθώς",
        // },
        // {
        //     description:
        //         "Οι εργασίες δεν τροποποιούν το αρχιτεκτονικό περίγραμμα ή τα γεωμετρικά χαρακτηριστικά των όψεων (όπως ανοίγματα, εξώστες, μορφολογικά στοιχεία).",
        // },
        // {
        //     description:
        //         "Δεν πραγματοποιούνται επεμβάσεις που θα είχαν ως αποτέλεσμα την αισθητική ή λειτουργική αλλοίωση των υφιστάμενων όψεων.",
        // },
        // {
           
        //     description:
        //         "Οι εργασίες αφορούν συντηρήσεις, επισκευές ή επαναχρωματισμούς επί των όψεων, με χρήση υλικών παρόμοιων ή ταυτόσημων με τα υφιστάμενα.",
        // },
        // // {
        //     title: "Τρίψιμο και γυάλισμα ξύλινου παρκέ",
        //     description:
        //         "Λείανση με ειδικά μηχανήματα, στοκάρισμα και εφαρμογή προστατευτικού βερνικιού για ανανέωση της όψης και αντοχής του ξύλινου δαπέδου.",
        // },
        // {
        //     title: "Τρίψιμο και γυάλισμα μαρμάρων",
        //     description:
        //         "Λείανση, στοκάρισμα και κρυσταλλοποίηση μαρμάρινων επιφανειών για αποκατάσταση λάμψης και καθαρότητας επιφάνειας.",
        // },
        // {
        //     title: "Τοποθέτηση πλακιδίων σε δάπεδο και τοίχους WC/Κουζίνας",
        //     description: "Προετοιμασία υποστρώματος, επικόλληση νέων πλακιδίων με κόλλα, αρμολόγηση και καθαρισμός.",
        // },
        // {
        //     title: "Κατασκευή από ξηρά δόμηση – Χώρισμα 1+1, Επένδυση 0+1 σε τοιχοποία και Οροφή από γυψοσανίδα",
        //     description:
        //         "Κατασκευή χωρισμάτων με μεταλλικό σκελετό και γυψοσανίδα, πλήρωση με υλικά ηχομόνωσης. Οροφές με σκελετό και ανάρτηση, φινίρισμα με αρμόστοκο.",
        // },
        // {
        //     title: "Εσωτερικοί χρωματισμοί – προετοιμασία, στοκαρίσματα και εφαρμογή",
        //     description:
        //         "Στοκάρισμα και τρίψιμο επιφανειών, εφαρμογή αστάρι και δύο χεριών βαφή σε τοίχους και ταβάνια με πλαστικό ή ακρυλικό χρώμα.",
        // },
        // {
        //     title: "Εξωτερικοί χρωματισμοί – προετοιμασία, στοκαρίσματα και εφαρμογή",
        //     description:
        //         "Στοκάρισμα και τρίψιμο επιφανειών, εφαρμογή αστάρι και δύο χεριών βαφή σε τοίχους και ταβάνια με πλαστικό ή ακρυλικό χρώμα.",
        // },
        // {
        //     title: "Τοποθέτηση νέων κουφωμάτων αλουμινίου στα ίδια ανοίγματα",
        //     description:
        //         "Αφαίρεση παλιών κουφωμάτων, τοποθέτηση νέων κουφωμάτων (παράθυρα/μπαλκονόπορτες) αλουμινίου με διπλά υαλοστάσια και θερμοδιακοπή.",
        // },
        // {
        //     title: "Αντικατάσταση ξύλινων επιφανειών στην κουζίνα & νέα εσωτερικά κουφώματα και ντουλάπες",
        //     description:
        //         "Αντικατάσταση παλαιών ντουλαπιών κουζίνας με νέα, τοποθέτηση νέων εσωτερικών πορτών MDF/laminate, νέες ντουλάπες υπνοδωματίων.",
        // },
        // {
        //     title: "Τοποθέτηση και μετακίνηση νέων σωμάτων καλοριφέρ",
        //     description:
        //         "Αποσύνδεση/τοποθέτηση νέων σωμάτων, μεταφορά σημείων βάσει μελέτης, νέα σωληνώσεις και υδραυλικές συνδέσεις, εξαερώσεις και δοκιμή.",
        // },
        // {
        //     title: "Θέρμανση / Ψύξη – Κλιματισμός",
        //     description:
        //         "Τοποθέτηση κλιματιστικών (split unit, πολυδιαιρούμενα), προκαλωδίωση & σωληνώσεις ψυκτικού υγρού (χωνευτά), αντικατάσταση λεβητοστασίου ή μετάβαση σε αντλία θερμότητας, τοποθέτηση θερμοστατών – ζωνών θέρμανσης.",
        // },
    ]

    return (
        <div className="max-w-[794px] mx-auto p-6 bg-white">
            {/* Title */}
            <h2 className="text-center font-semibold underline text-sm mb-2">
                ΤΕΧΝΙΚΗ ΕΚΘΕΣΗ ΕΡΓΑΣΙΩΝ - ΒΕΒΑΙΩΣΗ ΜΗΧΑΝΙΚΟΥ
            </h2>

            {/* Project Information */}
            <div className="mb-8 space-y-4">
                <div className="flex items-start justify-between max-w-[450px]">
                    <span className=" min-w-[80px] text-sm">Έργο:</span>
                    <h3 className=" text-sm">PROJECT DESCRIPTION</h3>
                </div>

                <div className="flex items-start justify-between gap-4 max-w-xl">
                    <span className=" text-sm">Θέση:</span>
                    <h3 className=" text-sm">ADDRESS, TOWN/AREA , POSTAL CODE ( FOR BUILDING)</h3>
                </div>

                <div className="flex items-start justify-between max-w-[400px] ml-[25px] text-sm">
                    <span className="">Ιδιοκτήτης:</span>
                    <h3 className=" text-sm">OWNER/OWNERS</h3>
                </div>
            </div>

            {/* Main Description */}
            <div className="text-sm mb-4 ml-6">
                <p>Στο ακίνητο <span className="font-semibold">Description for building/ horiontal property</span> επί της οδού <br /> <span className="font-semibold">Address,Town/Area , postal code ( FOR BUILDING),</span>
                    πρόκειται να <br /> εκτελεσθούν οι παρακάτω εργασίες :</p>
            </div>

            {/* Work Items List */}
            <div className="space-y-6 ml-6">
                {workItems.map((item, index) => (
                    <div key={index} className="flex gap-3">
                        <div className="text-lg font-bold mt-1 text-black">●</div>
                        <div className="flex-1">
                            <h3 className="font-bold text-black mb-2">{item.title}</h3>
                            {item.title === "Αλλαγή Χρήσης Χώρου" ? (
                                <div className="text-justify leading-relaxed text-sm text-black">
                                    <p className="mb-2">
                                        Αλλαγή Χρήσης Χώρου Η Αφορά την τροποποίηση της χρήσης του χώρου ................ (π.χ. ισόγειου αποθηκευτικού χώρου με εμβαδόν ... τ.μ.),
                                        ο οποίος βάσει της εγκεκριμένης οικοδομικής άδειας ......../........ φέρει χρήση ........ (π.χ. αποθήκης/χώρου στάθμευσης) και βρίσκεται στον
                                        ................ (όροφο/ισόγειο/υπόγειο), με αυτόνομη πρόσβαση μέσω ................ (π.χ. ιδιωτικής εισόδου ή κοινόχρηστων χώρων).
                                        Η κατασκευή του χώρου είναι σύμφωνη με την εγκεκριμένη στατική και αρχιτεκτονική μελέτη της άδειας. Η προτεινόμενη αλλαγή χρήσης αφορά
                                        τη μετατροπή του σε ................ (π.χ. κατοικία, κατάστημα κλπ.), χωρίς επέμβαση στον φέροντα οργανισμό ή τροποποίηση
                                        του εξωτερικού όγκου και των όψεων του κτιρίου, ενώ η νέα χρήση είναι πλήρως συμβατή με τις
                                        θεσμοθετημένες χρήσεις γης της περιοχής.
                                    </p>
                                </div>
                            ) : (
                                <p className="text-justify leading-relaxed text-sm text-black mb-5">{item.description}</p>
                            )}
                            
                        </div>
                        
                    </div>
                ))}
            </div>

                   {/* <p className="ml-7 text-sm mb-20">Η μορφή και η εικόνα του κτιρίου παραμένει αμετάβλητη, συνεπώς δεν απαιτείται η υποβολή όψεων σύμφωνα με τις διατάξεις του άρθρου 29 του Ν.4495/2017 και τις σχετικές ερμηνευτικές εγκυκλίους.</p> */}
            {/* {/* Signature Section */}
            <div className="mt-6 text-right flex items-center justify-center p-5">
                <div className="max-w-[300px]">

                    <div className="text-center">
                        <p>Ημερομηνία :</p>
                        <p>6/25/2025</p>
                    </div>
                    <div className="">
                        <h3 className="text-center mb-4">Ο ΜΗΧΑΝΙΚΟΣ</h3>
                        {/* Dashed Border Box = common component*/}
                        <StampComponent
                            title="ΣΦΡΑΓΙΔΑ ΜΗΧΑΝΙΚΟΥ"
                            instructions={[
                                "Με δεξί κλικ",
                                "Αλλαγή εικόνας",
                                " Βάζετε την σφραγίδα σας",
                            ]}
                        />
                    </div>
                </div>
            </div>

        </div>
    )
}



