"use client"
import StampComponent from "@/component/shared/dashed/Dashed"

export default function FileSevenDesignNine() {

    const workItems = [
        {

            title: "Ολοκληρωμένο Σύστημα Εξωτερικής Θερμομόνωσης με διογκωμένη πολυστερίνη και οργανικά έτοιμα επιχρίσματα",
            description: <>
                <div>
                    <p>Το Ολοκληρωμένο Σύστημα Εξωτερικής Θερμομόνωσης αποτελείται από:</p>
                <p>Πιστοποιημένες θερμομονωτικές πλάκες γραφιτούχας διογκωμένης πολυστερίνης,(με συντελεστή θερμικής αγωγιμότητας λ=....... W/mK) και πάχους .... εκ. βάσει της μελέτης Ενεργειακής Απόδοσης του κτιρίου, για χρήση σε συστήματα εξωτερικής θερμομόνωσης. Οι θερμομονωτικές πλάκες πρέπει να εφαρμόζονται σε επίπεδη και καθαρή επιφάνεια απαλλαγμένη από σκόνες, βρωμιές και λίπη τοποθετημένες σταυρωτά (όπως η τουβλοδομή) εφαρμοσμένες στα δομικά στοιχεία με κόλλα υψηλής συγκολλητικής ικανότητας, κατάλληλης για ανόργανα υποστρώματα σύμφωνα με τις προδιαγραφές του συστήματος. Σε παλαιές βαμμένες επιφάνειες ή επιφάνειες ξηράς δόμησης η συγκόλληση επιτυγχάνεται με οργανική κόλλα ενδεικτικού τύπου
                    . Τυχόν κενά στις ενώσεις των πλακών θα πληρούνται με θερμομονωτικό αφρό περιορισμένης αναφλεξιμότητας κλάση Β1 βάσει EN 13501.
                    Σε κάθε σημείο του κτιρίου όπου σταματά η θερμομόνωση (π.χ. στους λαμπάδες και τα πρέκια των κουφωμάτων, ποδιές παραθύρων κλπ.) χρησιμοποιείται η αυτοδιογκούμενη ταινία στεγάνωσης για να εξασφαλιστεί η στεγάνωση του συστήματος στα σημεία αυτά. Η ταινία τοποθετείται επί του σταθερού στοιχείου σύμφωνα με τα προβλεπόμενα από την μελέτη και πιέζεται επ' αυτού με την θερμομονωτική πλάκα. Για τη στερέωση και τη συγκράτηση του συστήματος της εξωτερικής θερμομόνωσης (θερμοπρόσοψη) με άλλα οικοδομικά στοιχεία θα απαιτηθούν ειδικές διατάξεις και ειδικά εξαρτήματα. Όλα τα προσκομιζόμενα υλικά θα είναι συσκευασμένα με σήμανση όπως προβλέπουν τα σχετικά πρότυπα και θα συνοδεύονται από επίσημα πιστοποιητικά συμμόρφωσης - επίδοσης από Διαπιστευμένο Φορέα.</p>
                <p className="mt-16">Οι θερμομονωτικές πλάκες θα πρέπει να είναι εναρμονισμένα με το πρότυπο ΕΝ 13163 : 2012 "Θερμομονωτικά προϊόντα κτιρίων Βιομηχανικά παραγόμενα προϊόντα από διογκωμένη ΤΕΧΝΙΚΗ ΠΕΡΙΓΡΑΦΗ 61 πολυστερίνη (xps)- προδιαγραφή". Ο συντελεστής θερμικής αγωγιμότητας λ της διογκωμένης πολυστερίνης θα πρέπει να αναγράφεται στην ετικέτα του προϊόντος.<br />

                    <p className="mt-6">Οργανικός έτοιμος προς χρήση σοβάς σε μορφή πάστας, με πιστοποίηση CE σύμφωνα με το πρότυπο EN 15824, κλάσης A2 σε αντίδραση στη φωτιά βάσει ΕΝ 13501, υψηλής ελαστικότητας, χωρίς τσιμέντο, με υψηλή αντοχή στις μηχανικές καταπονήσεις που επιτρέπει τον εμποτισμό υαλοπλέγματος για την πλήρη αντιρρηγματική προστασία του συστήματος με κατανάλωση ~2,8kg/m², ο οποίος απλώνεται ομοιόμορφα στο σύνολο της επιφάνειας των θερμομονωτικών πλακών και εντός του οποίου όσο είναι ακόμα υγρός εμβαπτίζεται υαλόπλεγμα, ανθεκτικό στα αλκάλια, σταθερών διαστάσεων, με μεγάλη ικανότητα απορρόφησης τάσεων (1700N/50mm), με επικάλυψη 10εκ στο σημείο συνάντησης των λωρίδων σύμφωνα με τις προδιαγραφές του συστήματος.
                    Προετοιμασία λείας τελικής επικάλυψης, εφαρμόζοντας οργανικό έτοιμο προς χρήση σοβά χρωματισμένου στην μάζα του σύμφωνα με τις απαιτήσεις της μελέτης, εμπλουτισμένο με πρόσθετα για προστασία ενάντια σε άλγη και μύκητες, με πιστοποίηση CE σύμφωνα με το πρότυπο EN 15824, σε κατανάλωση ~1,8kg/m².</p> <br />
                    Ο τελικός σοβάς είναι ιδιαίτερα ελαστικός, ανθεκτικός σε μηχανικές καταπονήσεις, εξαιρετικά ανθεκτικός σε μικροοργανισμούς, με πιστοποίηση CE σύμφωνα με το πρότυπο EN 15824 και κλάσης A2 σε αντίδραση στη φωτιά βάσει ΕΝ 13501, υψηλής υδρατμοδιαπερατότητας και υδροφοβίας. <br />
                    Τελική επικάλυψη με οργανικό λεπτόκοκκο έτοιμο προς χρήση σοβά σε κατανάλωση ~1,4 kg/m²., για δημιουργία λείων τελικών επιφανειών σε συστήματα εξωτερικής θερμομόνωσης, χρωματισμένο στην μάζα του σύμφωνα με τις απαιτήσεις της μελέτης, εμπλουτισμένο με πρόσθετα για προστασία ενάντια σε άλγη και μύκητες, με πιστοποίηση CE σύμφωνα με το πρότυπο EN 15824 και κλάσης A2 σε αντίδραση στη φωτιά βάσει ΕΝ 13501..</p>
                </div>
            </>

            // title: "Αλλαγή Χρήσης Χώρου",
            // description: `Αφορά την τροποποίηση της χρήσης του χώρου `,
            // fields: [
            //     { key: "area", placeholder: "εμβαδόν … τ.μ." },
            //     { key: "currentUse", placeholder: "αποθήκης/χώρου στάθμευσης" },
            //     { key: "floor", placeholder: "όροφο/ισόγειο/υπόγειο" },
            //     { key: "access", placeholder: "ιδιωτικής εισόδου ή κοινόχρηστων χώρων" },
            //     { key: "newUse", placeholder: "κατοικία, κατάστημα κλπ." },
            // ],
            // fullText: `(π.χ. ισόγειου αποθηκευτικού χώρου με εμβαδόν … τ.μ.), ο οποίος βάσει της εγκεκριμένης οικοδομικής άδειας ………/……… φέρει χρήση …………………… (π.χ. αποθήκης/χώρου στάθμευσης) και βρίσκεται στον …………………… (όροφο/ισόγειο/υπόγειο), με αυτόνομη πρόσβαση μέσω …………………… (π.χ. ιδιωτικής εισόδου ή κοινόχρηστων χώρων). Η κατασκευή του χώρου είναι σύμφωνη με την εγκεκριμένη στατική και αρχιτεκτονική μελέτη της άδειας. Η προτεινόμενη αλλαγή χρήσης αφορά τη μετατροπή του σε …………………… (π.χ. κατοικία, κατάστημα κλπ.), χωρίς επέμβαση στον φέροντα οργανισμό ή τροποποίηση του εξωτερικού όγκου και των όψεων του κτιρίου, ενώ η νέα χρήση είναι πλήρως συμβατή με τις θεσμοθετημένες χρήσεις γης της περιοχής.`,
        },
        {
            title: "Δημιουργία Νέων Ανοιγμάτων (Παράθυρα / Πόρτες / Βιτρίνες)",
            description:
                <>
                    <p>Στο πλαίσιο της βελτίωσης της ενεργειακής απόδοσης και της θερμικής άνεσης, προβλέπεται η εφαρμογή παθητικών ηλιακών συστημάτων όπως:</p>

                    <p className="my-3">-Τοποθέτηση σταθερών σκιάστρων (μεταλλικών ή ξύλινων) στις όψεις του κτιρίου.</p>

                    <p>-Εφαρμογή ανακλαστικών επιστρώσεων σε δομικά στοιχεία ή σε υαλοστάσια (όπου απαιτείται).</p>
                </>
        },

    ]

    return (
        <div className="max-w-[794px] mx-auto p-6 bg-white">
            {/* Title */}
            <h2 className="text-center font-semibold underline text-sm mb-2">
                ΤΕΧΝΙΚΗ ΕΚΘΕΣΗ ΕΡΓΑΣΙΩΝ - ΒΕΒΑΙΩΣΗ ΜΗΧΑΝΙΚΟΥ
            </h2>

            {/* Project Information */}
            <div className="mb-8 space-y-4">
                <div className="flex items-start justify-between max-w-[450px]">
                    <span className=" min-w-[80px] text-sm">Έργο:</span>
                    <h3 className=" text-sm">PROJECT DESCRIPTION</h3>
                </div>

                <div className="flex items-start justify-between gap-4 max-w-xl">
                    <span className=" text-sm">Θέση:</span>
                    <h3 className=" text-sm">ADDRESS, TOWN/AREA , POSTAL CODE ( FOR BUILDING)</h3>
                </div>

                <div className="flex items-start justify-between max-w-[400px] ml-[25px] text-sm">
                    <span className="">Ιδιοκτήτης:</span>
                    <h3 className=" text-sm">OWNER/OWNERS</h3>
                </div>
            </div>

            {/* Main Description */}
            <div className="text-sm mb-4 ml-6">
                <p>Στο ακίνητο <span className="font-semibold">Description for building/ horiontal property</span> επί της οδού <br /> <span className="font-semibold">Address,Town/Area , postal code ( FOR BUILDING),</span>
                    πρόκειται να <br /> εκτελεσθούν οι παρακάτω εργασίες :</p>
            </div>

            {/* Work Items List */}
            <div className="space-y-6 ml-6">
                {workItems.map((item, index) => (
                    <div key={index} className="flex gap-3">
                        <div className="text-lg font-bold mt-1 text-black">●</div>
                        <div className="flex-1">
                            <h3 className="font-bold text-black mb-2">{item.title}</h3>
                            {item.title === "Αλλαγή Χρήσης Χώρου" ? (
                                <div className="text-justify leading-relaxed text-sm text-black">
                                    <p className="mb-2">
                                        Αλλαγή Χρήσης Χώρου Η Αφορά την τροποποίηση της χρήσης του χώρου ................ (π.χ. ισόγειου αποθηκευτικού χώρου με εμβαδόν ... τ.μ.),
                                        ο οποίος βάσει της εγκεκριμένης οικοδομικής άδειας ......../........ φέρει χρήση ........ (π.χ. αποθήκης/χώρου στάθμευσης) και βρίσκεται στον
                                        ................ (όροφο/ισόγειο/υπόγειο), με αυτόνομη πρόσβαση μέσω ................ (π.χ. ιδιωτικής εισόδου ή κοινόχρηστων χώρων).
                                        Η κατασκευή του χώρου είναι σύμφωνη με την εγκεκριμένη στατική και αρχιτεκτονική μελέτη της άδειας. Η προτεινόμενη αλλαγή χρήσης αφορά
                                        τη μετατροπή του σε ................ (π.χ. κατοικία, κατάστημα κλπ.), χωρίς επέμβαση στον φέροντα οργανισμό ή τροποποίηση
                                        του εξωτερικού όγκου και των όψεων του κτιρίου, ενώ η νέα χρήση είναι πλήρως συμβατή με τις
                                        θεσμοθετημένες χρήσεις γης της περιοχής.
                                    </p>
                                </div>
                            ) : (
                                <p className="text-justify leading-relaxed text-sm text-black mb-5">{item.description}</p>
                            )}

                        </div>

                    </div>
                ))}
            </div>

            {/* <p className="ml-7 text-sm mb-20">Η μορφή και η εικόνα του κτιρίου παραμένει αμετάβλητη, συνεπώς δεν απαιτείται η υποβολή όψεων σύμφωνα με τις διατάξεις του άρθρου 29 του Ν.4495/2017 και τις σχετικές ερμηνευτικές εγκυκλίους.</p> */}
            {/* {/* Signature Section */}
            <div className="mt-6 text-right flex items-center justify-center p-5">
                <div className="max-w-[300px]">

                    <div className="text-center">
                        <p>Ημερομηνία :</p>
                        <p>6/25/2025</p>
                    </div>
                    <div className="">
                        <h3 className="text-center mb-4">Ο ΣΥΝΤΑΞΑΣ</h3>
                        {/* Dashed Border Box = common component*/}
                        <StampComponent
                            title="ΣΦΡΑΓΙΔΑ ΜΗΧΑΝΙΚΟΥ"
                            instructions={[
                                "Με δεξί κλικ",
                                "Αλλαγή εικόνας",
                                " Βάζετε την σφραγίδα σας",
                            ]}
                        />
                    </div>
                </div>
            </div>

        </div>
    )
}
