import StampComponent from "@/component/shared/dashed/Dashed";
import React from "react";

function FileThirteenDesignFour() {
  return (
    <div className="max-w-[632px] mx-auto">
      {/* Title */}
      <h2 className="text-center font-semibold text-xl mb-6 underline">
        ΤΕΧΝΙΚΗ ΕΚΘΕΣΗ ΕΡΓΑΣΙΩΝ - ΒΕΒΑΙΩΣΗ ΜΗΧΑΝΙΚΟΥ
      </h2>

      {/* Project Row */}
      <div className="grid grid-cols-12 gap-2">
        <label className="col-span-2 font-medium">Έργο:</label>
        <div className="col-span-10">PROJECT DESCRIPTION</div>
      </div>

      {/* Address Row */}
      <div className="grid grid-cols-12 gap-2 mb-4 mt-20">
        <label className="col-span-2 font-medium">Θέση:</label>
        <div className="col-span-10">
          ADDRESS, TOWN/AREA , POSTAL CODE (FOR BUILDING)
        </div>
      </div>

      <div className="lg:ml-12">
        {/* Owner Row */}
        <div className="grid grid-cols-12 gap-2">
          <label className="col-span-2 font-medium">Ιδιοκτήτης:</label>
          <div className="col-span-10">OWNER / OWNERS</div>
        </div>

        {/* Greek Description */}
        <p className="my-10">
          Στο ακίνητο{" "}
          <span className="text-sm font-semibold">
            Description for building/horizontal property
          </span>
          επί της οδού <br />{" "}
          <span className="text-lg font-semibold">
            Address, Town/Area, postal code (FOR BUILDING)
          </span>
          , πρόκειται να εκτελεσθούν οι παρακάτω εργασίες :
        </p>

        {/* Bullet Point */}
        <div className="mt-4">
          <p className="font-semibold text-lg mb-2">
            ● Χωματουργικές Εργασίες – Εκσκαφή Πισίνας
          </p>
          <p className="text-sm leading-relaxed">
            Οι χωματουργικές εργασίες αφορούν την εκσκαφή του εδάφους για τη
            διαμόρφωση του σκάμματος της πισίνας, σύμφωνα με τις εγκεκριμένες
            μελέτες και τις τεχνικές προδιαγραφές του έργου.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            Η εκσκαφή θα εκτελεστεί σε βάθος και διαστάσεις που ορίζονται από τη
            στατική και την αρχιτεκτονική μελέτη της πισίνας, λαμβάνοντας υπόψη
            τα γεωτεχνικά χαρακτηριστικά του εδάφους, με στόχο την εξασφάλιση
            της σταθερότητας των πρανών και την αποφυγή καθιζήσεων.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            Οι εργασίες θα περιλαμβάνουν:
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Χάραξη και οριοθέτηση του σκάμματος με κατάλληλη σήμανση ασφαλείας.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Απομάκρυνση φυτικής γης και ακατάλληλων υλικών.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Εκσκαφή με μηχανικά μέσα (εκσκαφείς - φορτωτές) με προσεκτική
            διαχείριση των προϊόντων εκσκαφής.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Αποθήκευση ή απομάκρυνση των προϊόντων εκσκαφής, σύμφωνα με τις
            προβλέψεις της μελέτης και τις ισχύουσες περιβαλλοντικές διατάξεις.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Λήψη προληπτικών μέτρων ασφαλείας για τη στήριξη των πρανών, αν
            απαιτείται.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            Αναφορά σε Αρχαιολογικές Υπηρεσίες: <br />
            Δεδομένης της φύσης του έργου και του βάθους εκσκαφής, καθώς και
            σύμφωνα με την ισχύουσα νομοθεσία (Ν. 3028/2002 "Για την προστασία
            των Αρχαιοτήτων και της Πολιτιστικής Κληρονομιάς"), υπάρχει εγκριση
            εκσκαφής από την αρμόδια υπηρεσία.
          </p>
        </div>
        <div className="mt-24">
          <p className="font-semibold text-lg">
            ● Κατασκευή Οπλισμένου Σκυροδέματος – Πυθμένας Πισίνας
          </p>
          <p className="text-sm leading-relaxed">
            Οι εργασίες περιλαμβάνουν τα εξής στάδια:
          </p>
          <p className="text-sm leading-relaxed mt-3">
            Καθαρισμός και προετοιμασία του σκάμματος εκσκαφής, εξασφαλίζοντας
            κατάλληλη βάση έδρασης.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            Διαμόρφωση υπόβασης δαπέδου (στρώση καθαριότητας) με σκυρόδεμα
            κατηγορίας C12/15 ή αντίστοιχης.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            Τοποθέτηση οπλισμού (χαλύβδινοι ράβδοι B500C ή B500A) για τον
            πυθμένα της πισίνας με τήρηση των απαιτήσεων επικάλυψης και
            αγκυρώσεων, σύμφωνα με τη στατική μελέτη.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            Τοποθέτηση όλων των αναγκαίων ενσωματωμένων στοιχείων, όπως τα
            εντοιχισμένα εξαρτήματα σωληνώσεων (skimmers, φώτα πισίνας, στόμια
            αναρρόφησης-επιστροφής), πριν την έγχυση του σκυροδέματος.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            Κατασκευή διακοπτόμενων αρμών σκυροδέτησης με χρήση ειδικών ταινιών
            αρμών (PVC waterstops), για αποφυγή διαρροών.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            Έγχυση σκυροδέματος κατηγορίας C25/30 ή ανώτερης, ανάλογα με τη
            μελέτη, με κατάλληλη δόνηση και συμπύκνωση, ώστε να αποτραπούν κενά
            και φωλιές.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            Επιμελημένη επιφάνεια τελικής διαμόρφωσης, κατάλληλη για επόμενες
            φάσεις (υγρομόνωση και επένδυση).
          </p>
        </div>
        {/* <div className="mt-24">
          <p className="font-semibold text-lg">
            ● Προδιαγραφές Κολυμβητικής Δεξαμενής έως 50 τ.μ
          </p>
          <p className="text-sm leading-relaxed">
            Η εν λόγω κολυμβητική δεξαμενή βρίσκεται στον περιβάλλοντα χώρο του
            οικοπέδου, είναι «υπαίθρια» ιδιωτικής χρήσεως και έχει σχήμα
            παραλληλόγραμμο.
          </p>
          <p className="text-sm leading-relaxed">
Οι διαστάσεις ειναι Α x B  και η επιφάνεια αυτής είναι μ2 και ανήκει στην κατηγορία των μικρών κολυμβητικών δεξαμενών (<350 m2). O όγκος του νερού της πισίνας είναι μ2 (μέσο βάθος 1,30-1,50m).
          </p>
          <p className="text-sm leading-relaxed">
H κολυμβητική δεξαμενή είναι κατασκευασμένη ως εξής: Ό πυθμένας είναι από μπετόν και τα τοιχία από προκατασκευασμένα μεταλλικά πάνελ πού αντικαθιστούν το μπετόν ενώ οι τελικές επιφάνειες των πλευρικών τοιχωμάτων και του δαπέδου είναι καλυμμένες από μεμβράνη ( liner ) πάχους 75/100°.
          </p>
          <p className="text-sm leading-relaxed">
Το βάθος νερού είναι 1,50m
          </p>
        </div> */}
        <div className="mt-24">
          <p className="font-semibold text-lg">
            ● Τροφοδότηση της Κολυμβητικής Δεξαμενής
          </p>
          <p className="text-sm leading-relaxed">
            Η τροφοδοσία της κολυμβητικής δεξαμενής με νερό θα πραγματοποιείται
            μέσω σύνδεσης με το υφιστάμενο δίκτυο ύδρευσης της κατοικίας,
            σύμφωνα με τις ισχύουσες υγειονομικές και τεχνικές διατάξεις.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            Το σύστημα τροφοδότησης θα περιλαμβάνει:
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Εγκατάσταση σωληνώσεων κατάλληλης διατομής και υλικού (συνήθως
            πολυαιθυλένιο PE ή δικτυωμένο πολυαιθυλένιο PEX ή πολυπροπυλένιο
            PP-R), κατάλληλων για πόσιμο νερό.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Διακοπτικό όργανο (βαλβίδα) στο σημείο τροφοδότησης, για έλεγχο και
            διακοπή της παροχής νερού προς την πισίνα όταν απαιτείται.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Τοποθέτηση αντισιφωνικής διάταξης (backflow prevention device) για
            την αποτροπή επιστροφής νερού από την πισίνα στο δίκτυο πόσιμου
            νερού, όπως απαιτείται από τον Κανονισμό Ύδρευσης και τις
            Υγειονομικές Διατάξεις.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Σύνδεση με το μηχανοστάσιο της πισίνας, ώστε το νερό πλήρωσης να
            οδηγείται με ελεγχόμενο τρόπο εντός της δεξαμενής μέσω ειδικής
            παροχής (π.χ. ειδική σωλήνα πλήρωσης ή μέσω φίλτρου αν απαιτείται).
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Πρόβλεψη ογκομέτρησης / υδρομέτρησης (εφόσον ζητηθεί), ώστε να
            υπάρχει έλεγχος της κατανάλωσης νερού για την πισίνα.
          </p>
        </div>
        <div className="mt-24">
          <p className="font-semibold text-lg">
            ● Στόμια εισροής – εκροής – εκκενώσεως
          </p>
          <p className="text-sm leading-relaxed">
            Η εκκένωση της δεξαμενής γίνεται σε χρόνο μικρότερο των 4 ωρών.
          </p>
          <p className="text-sm leading-relaxed">
            Η αποχέτευση της δεξαμενής γίνεται μέσω φρεατίου στο δίκτυο όμβριων
            της κατοικίας.
          </p>
          <p className="text-sm leading-relaxed">
            Η πλήρωση της δεξαμενής γίνεται σε χρόνο .............. ωρών από το
            δίκτυο υδρεύσεως της κατοικίας μέσω αγωγού που καταλήγει στον κάδο
            καταθλίψεως.
          </p>
          <p className="text-sm leading-relaxed">Κολυμβητική Πισίνα</p>
          <p className="text-sm leading-relaxed">
            Έχουν εγκατασταθεί 4 στόμια εισροής, περιμετρικά, σε βάθος 0,60m και
            σε αποστάσεις μέχρι 2,0m μεταξύ τους. Τα στόμια είναι διαμέτρου 50mm
            παροχής 7,5 m3/h και φέρουν ρυθμιζόμενο διάφραγμα για την ρύθμιση
            της παροχής. Συνδέονται στον αγωγό προσαγωγής με σωλήνα Φ63mm.
          </p>
          <p className="text-sm leading-relaxed">
            Για την εκκένωση και την ανακυκλοφορία του 50% του νερού της
            δεξαμενής έχει τοποθετηθεί ένα φρεάτιο πυθμένα διαστάσεων 228 Χ
            228mm στο δάπεδο της δεξαμενής.
          </p>
        </div>
        <div className="mt-18">
          <p className="font-semibold text-lg">● Skimmer</p>
          <p className="text-sm leading-relaxed">
            Στην κολυμβητική δεξαμενή έχουν εγκατασταθεί τρία skimmer για την
            απομάκρυνση της επιφανειακής στιβάδας ύδατος μέσω των οποίων θα
            ανακυκλοφορεί το 50% του νερού της δεξαμενής.
          </p>
          <p className="text-sm leading-relaxed">
            Ο καθαρισμός του φίλτρου διυλίσεως γίνεται με αντίστροφη πλύση-Bach
            Wash (αλλαγή της ροής του νερού στο φίλτρο μέσω κατάλληλης
            διατάξεως)
          </p>
        </div>
        <div className="mt-24">
          <p className="font-semibold text-lg">
            ● Απολύμανση Νερού Κολυμβητικής Δεξαμενής με Μέθοδο Ηλεκτρόλυσης
            Άλατος
          </p>
          <p className="text-sm leading-relaxed">
            Η απολύμανση του νερού της κολυμβητικής δεξαμενής θα γίνεται μέσω
            συστήματος ηλεκτρόλυσης άλατος, μια σύγχρονη και φιλική προς το
            περιβάλλον μέθοδο, η οποία εξασφαλίζει συνεχή και αποτελεσματική
            απολύμανση του νερού, περιορίζοντας τη χρήση χημικών προϊόντων.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            Η διαδικασία περιλαμβάνει τα εξής στάδια:
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Προσθήκη χλωριούχου νατρίου (κοινό αλάτι - NaCl) στο νερό της
            πισίνας, σε αναλογία περίπου 3-5 kg/m³.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Το νερό, καθώς κυκλοφορεί στο σύστημα φίλτρανσης, διέρχεται μέσα
            από ειδικό ηλεκτρολυτικό κελί (electrolytic cell), όπου με τη χρήση
            ηλεκτρικής τάσης διασπάται το αλάτι και παράγεται υποχλωριώδες
            νάτριο (NaOCl).
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Το παραγόμενο υποχλωριώδες νάτριο λειτουργεί ως ισχυρό
            απολυμαντικό, εξουδετερώνοντας βακτήρια, μικροοργανισμούς και ρύπους
            στο νερό της πισίνας.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Το υποχλωριώδες νάτριο στη συνέχεια αποσυντίθεται και επανέρχεται
            σε αλάτι, δημιουργώντας έναν συνεχή κύκλο ανακυκλούμενης
            απολύμανσης, μειώνοντας την ανάγκη για εξωτερική προσθήκη χλωρίου.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Το σύστημα διαθέτει πίνακα ελέγχου και ρυθμιστή παραγωγής
            απολυμαντικού, ώστε να διασφαλίζεται η διατήρηση των τιμών ελεύθερου
            χλωρίου στο νερό σε επιτρεπτά και υγειονομικά επίπεδα, όπως ορίζουν
            οι ισχύουσες Υγειονομικές Διατάξεις.
          </p>
        </div>
        <div className="mt-24">
          <p className="font-semibold text-lg">
            ● Φωτισμός Κολυμβητικής Δεξαμενής
          </p>
          <p className="text-sm leading-relaxed">
            Για την κάλυψη των αναγκών φωτισμού της κολυμβητικής δεξαμενής κατά
            τις νυχτερινές ώρες, προβλέπεται η εγκατάσταση τριών (3) υποβρύχιων
            φωτιστικών σωμάτων τύπου LED, ισχύος 24W έκαστο, κατάλληλων για
            λειτουργία σε υποβρύχιες συνθήκες.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            Τα φωτιστικά λειτουργούν με χαμηλή τάση 12V AC, η οποία
            επιτυγχάνεται μέσω ειδικού μετασχηματιστή ασφαλείας ισχύος 150W, με
            είσοδο 230V AC και έξοδο 12V AC, εξασφαλίζοντας προστασία έναντι
            ηλεκτροπληξίας και συμμόρφωση με τις ευρωπαϊκές προδιαγραφές
            ασφαλείας για υποβρύχιες εγκαταστάσεις (EN 60598-2-18, EN 61439-1
            κ.ά.).
          </p>
          <p className="text-sm leading-relaxed mt-3">
            Η ηλεκτρολογική εγκατάσταση περιλαμβάνει:
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Υποβρύχια καλώδια ειδικού τύπου (π.χ. H07RN-F ή αντίστοιχο),
            ανθεκτικά σε υγρασία και μηχανικές καταπονήσεις.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Προστατευτικό πίνακα ελέγχου, που θα περιλαμβάνει ασφάλειες και
            ρελέ διαφυγής έντασης (RCD) ευαισθησίας ≤30mA, για προστασία χρηστών
            και εξοπλισμού.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Στεγανά κουτιά σύνδεσης, κατάλληλα για υπόγεια ή εξωτερική χρήση,
            σύμφωνα με τις απαιτήσεις προστασίας IP.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Διακόπτες χειρισμού ή/και αυτοματισμούς, για την ανεξάρτητη
            ενεργοποίηση του φωτισμού.
          </p>
        </div>
        <div className="mt-24">
          <p className="font-semibold text-lg">
            ● Εγκατάσταση Σωληνώσεων Κυκλοφορίας και Φίλτρανσης Πισίνας
          </p>
          <p className="text-sm leading-relaxed">
            Η κυκλοφορία του νερού της κολυμβητικής δεξαμενής, καθώς και η
            σύνδεση όλων των απαιτούμενων συστημάτων φίλτρανσης, αναρρόφησης,
            επαναφοράς και υπερχείλισης, θα πραγματοποιηθεί μέσω δικτύου
            σωληνώσεων από πλαστικό υλικό PVC-U (Unplasticized Polyvinyl
            Chloride), ειδικού τύπου για συστήματα ύδρευσης και πισίνας.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            Οι σωληνώσεις θα έχουν αντοχή σε πίεση 10 atm (PN10) και θα είναι
            πιστοποιημένες σύμφωνα με τα ευρωπαϊκά πρότυπα (EN 1452 ή ισοδύναμο)
            για χρήση σε εγκαταστάσεις υπό πίεση.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            Οι εργασίες θα περιλαμβάνουν:
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Τοποθέτηση σωλήνων PVC-U PN10 κατάλληλης διατομής, ανάλογα με τις
            απαιτήσεις παροχής του συστήματος (συνήθως διαμέτρων Φ50, Φ63, Φ75,
            Φ90 ή μεγαλύτερες ανάλογα με τη μελέτη).
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Συνδέσεις με κόλληση (solvent cement welding) για πλήρη στεγανότητα
            και αντοχή σε πίεση και χημικά πρόσθετα του νερού της πισίνας.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Ενσωμάτωση απαραίτητων εξαρτημάτων (γωνίες, ταυ, μούφες, βάνες,
            αντεπιστροφές κ.λπ.), ανάλογα με τη γεωμετρία και τις απαιτήσεις του
            δικτύου.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Πρόβλεψη βανών απομόνωσης, για την εύκολη συντήρηση και επισκευή
            των επιμέρους τμημάτων του κυκλώματος.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Διαμόρφωση των δικτύων με τις κατάλληλες κλίσεις και στήριξη, ώστε
            να εξασφαλίζεται η σωστή λειτουργία του συστήματος και η αποφυγή
            συγκέντρωσης αέρα ή στασιμότητας νερού.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            Όλα τα υλικά θα είναι ανθεκτικά σε χλώριο, υπεριώδη ακτινοβολία και
            υψηλές θερμοκρασίες, όπως απαιτείται για συστήματα πισίνας.
          </p>
        </div>
        <div className="mt-24">
          <p className="font-semibold text-lg">
            ● Σύστημα Ανακυκλοφορίας και Διύλισης Νερού Κολυμβητικής Δεξαμενής
          </p>
          <p className="text-sm leading-relaxed mt-3">
            Αναλυτική Περιγραφή: <br /> Για τη διασφάλιση της σωστής ποιότητας
            και καθαρότητας του νερού της κολυμβητικής δεξαμενής, έχει
            εγκατασταθεί ένα αυτόνομο, προκατασκευασμένο, compact πολυεστερικό
            συγκρότημα φίλτρανσης και ανακυκλοφορίας, με συνολικές διαστάσεις
            1,75m x 1,55m x 0,85m ύψος, εξοπλισμένο με καταπακτή επιθεώρησης και
            πρόσβασης.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            Το συγκρότημα περιλαμβάνει:
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Προφίλτρο / Τριχοπαγίδα (hair & lint strainer): <br />
            Στοιχείο προστασίας της αντλίας, το οποίο παγιδεύει μεγάλα
            σωματίδια, φύλλα, τρίχες κ.λπ., πριν το νερό εισέλθει στο αντλητικό
            σύστημα.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Αντλία Κυκλοφορίας: <br />Η αντλία έχει ισχύ 1,50HP και παροχή 22
            m³/h, διαστασιολογημένη ώστε να εξασφαλίζει τη συνεχή και ομαλή
            ανακυκλοφορία όλου του όγκου του νερού της πισίνας σε εύλογο χρονικό
            διάστημα (σύμφωνα με τις απαιτήσεις της υγειονομικής νομοθεσίας και
            τις προδιαγραφές της μελέτης).
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Φίλτρο Διύλισης Τύπου Άμμου (Sand Filter): <br />
            Φίλτρο διαστασιολογημένο για παροχή 22 m³/h, κατάλληλο για την
            κατακράτηση αιωρούμενων σωματιδίων και την επίτευξη απαιτούμενων
            ποιοτικών προδιαγραφών νερού πισίνας.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Το σύστημα περιλαμβάνει βαλβίδες πολλαπλών λειτουργιών (multiport
            valve) για επιλογή λειτουργίας (φίλτρανση, backwash, rinse, κλπ.),
            μανόμετρα για τον έλεγχο της πίεσης λειτουργίας και σωληνώσεις
            κατάλληλων διατομών, σύμφωνα με τις απαιτήσεις της εγκατάστασης.
          </p>
          <p className="text-sm leading-relaxed mt-3">
            -Ο ρυθμός ανακυκλοφορίας έχει υπολογιστεί ώστε να τηρεί τις
            προβλέψεις της Υγειονομικής Διάταξης για τις ιδιωτικές πισίνες,
            εξασφαλίζοντας την επαρκή διύλιση όλου του όγκου νερού μέσα σε χρόνο
            που δεν υπερβαίνει τις μέγιστες επιτρεπόμενες τιμές (συνήθως 4-6
            ώρες για ιδιωτικές πισίνες).
          </p>
        </div>
      </div>
      <div className="mt-20 flex items-center justify-center">
        <div>
          {/* Header Section */}
          <div className="text-center mb-8">
            <h2 className="text-xl mb-2">Ημερομηνία</h2>
            <p className="text-lg text-gray-600 mb-6">6/25/2025</p>

            <h3 className="text-lg font-medium text-gray-700 mb-4">
              Ο ΜΗΧΑΝΙΚΟΣ
            </h3>
          </div>

          {/* Dashed Border Box = common component*/}
          <StampComponent
            title="ΣΦΡΑΓΙΔΑ ΜΗΧΑΝΙΚΟΥ"
            instructions={[
              "Με δεξί κλικ",
              "Αλλαγή εικόνας",
              " Βάζετε την σφραγίδα σας",
            ]}
          />
        </div>
      </div>
    </div>
  );
}

export default FileThirteenDesignFour;
